terraform plan would create the job_template.
```
 # awx_job_template.job_templates["JTA_certificate_renewal_pre_tasks"] will be created
  + resource "awx_job_template" "job_templates" {
      + allow_simultaneous                  = false
      + ask_credential_on_launch            = false
      + ask_diff_mode_on_launch             = false
      + ask_execution_environment_on_launch = false
      + ask_forks_on_launch                 = false
      + ask_instance_groups_on_launch       = false
      + ask_inventory_on_launch             = false
      + ask_job_slice_count_on_launch       = false
      + ask_job_type_on_launch              = false
      + ask_labels_on_launch                = false
      + ask_limit_on_launch                 = false
      + ask_scm_branch_on_launch            = false
      + ask_skip_tags_on_launch             = false
      + ask_tags_on_launch                  = false
      + ask_timeout_on_launch               = false
      + ask_variables_on_launch             = false
      + ask_verbosity_on_launch             = false
      + become_enabled                      = false
      + diff_mode                           = false
      + extra_vars                          = "---"
      + force_handlers                      = false
      + forks                               = 0
      + id                                  = (known after apply)
      + inventory                           = (known after apply)
      + job_slice_count                     = 1
      + job_tags                            = "certificate_pre_task"
      + job_type                            = "run"
      + name                                = "JTA_Certificate renewal_Pre-Tasks"
      + playbook                            = "certificate_renewal_from_librenms_2.0.yml"
      + prevent_instance_group_fallback     = false
      + project                             = (known after apply)
      + survey_enabled                      = false
      + timeout                             = 0
      + use_fact_cache                      = false
      + verbosity                           = 0
```
